package com.wangming.algorithm.dataAlgorithm;


/**
 * 描述：
 * 1) 修路问题 => 最小生成树(加权值)【数据结构】+ 普利姆算法
 * 2) 最短路径问题 => 图+弗洛伊德算法
 * 3) 汉诺塔 => 分支算法
 * 4) 八皇后问题 => 回溯法
 * <p>
 * 2.3 线性结构和非线性结构 数据结构包括:线性结构和非线性结构。
 * 2.3.1 线性结构
 * 1) 线性结构作为最常用的数据结构，其特点是数据元素之间存在一对一的线性关系；数组
 * 2) 线性结构有两种不同的存储结构，即顺序存储结构(数组)和链式存储结构(链表)。顺序存储的线性表称为顺序表，顺序表中的存储元素是连续的
 * 3) 链式存储的线性表称为链表，链表中的存储元素不一定是连续的，元素节点中存放数据元素以及相邻元素的地
 * 址信息
 * 4) 线性结构常见的有:数组、队列、链表和栈，后面我们会详细讲解.
 *
 * @version V1.0
 * @auther MaiZi
 * @date 2019-07-23 10:39
 */
public class Day1_Algorithm_Test_1 {


}

